ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/МП_КатегорииYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_КатегорииYML</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>parentId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвитоПодкатегорияТоваров</name>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/RecordSetModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
	
		// Заполнение измерения id
		Если ТекущаяЗапись.id = 0 Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	МАКСИМУМ(МП_КатегорииYML.id) КАК id
						   |ИЗ
						   |	РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML";

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() И ТипЗнч(Выборка.id) = Тип("Число") Тогда
				ТекущаяЗапись.id = Выборка.id + 1;
			Иначе
				ТекущаяЗапись.id = 1;
			КонецЕсли;

		КонецЕсли;

		// Заполнение измерения parentId
		Если ТекущаяЗапись.Родитель <> Справочники.ВидыНоменклатуры.ПустаяСсылка() И ТекущаяЗапись.parentId = 0 Тогда

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Категория", ТекущаяЗапись.Родитель);
			Запрос.Текст = "ВЫБРАТЬ
						   |	МП_КатегорииYML.id КАК id
						   |ИЗ
						   |	РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML
						   |ГДЕ
						   |	МП_КатегорииYML.Категория = &Категория";

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				ТекущаяЗапись.parentId = Выборка.id;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
